In [1]:
import pandas as pd

# import data
df = pd.read_csv('raw_data.csv')
data = df.copy()

data

    id          name   age country   gender   income
0    1      John Doe  29.0     USA     Male  55000.0
1    1      John Doe  29.0     USA     Male  55000.0
2    2    Jane Smith   NaN  Canada   Female  62000.0
3    3          Alex   NaN     USA  Unknown  47000.0
4    4  Maria Garcia  34.0   Spain   Female      NaN
5    5        Li Wei  27.0   China     Male  51000.0
6    6           NaN  45.0   India   Female  73000.0
7    7    Ahmed Khan  38.0     NaN     Male  68000.0
8    8    Rachel Lee  29.0     USA   Female  62000.0
9    9   Carlos Ruiz   NaN  Mexico     Male  45000.0
10  10   Emily Davis  31.0     USA      NaN  58000.0

In [2]:
# Cleaning Data : Handling Data Types

age_mean = data["age"].mean()
data["age"] = data["age"].fillna(age_mean)


# conversion of data type : float to int
print(data["age"].dtypes)
data["age"] = data["age"].astype("int64")
print(data["age"].dtypes)

float64
int64

In [3]:
aqi_data = pd.read_csv('globalAirQuality.csv')
print(aqi_data["timestamp"].dtype)

# conversion of data type : object to datetime
aqi_data["timestamp"] = pd.to_datetime(aqi_data["timestamp"])
print(aqi_data["timestamp"].dtype)

object
datetime64[ns]